Repository: lisa-komarova/pro_dictant
Catalog: lib/l10n/app_*.arb
Languages: ru

source: profile
ru: профиль

source: dictionary
ru: словарь

# trainings
source: training
ru: тренажёры

source: word sets
ru: наборы слов

source: new set
ru: новый набор

# newSetTitle
source: new set
ru: новый набор

source: edit set
ru: изменить набор

# enterSetName
source: enter name
ru: введите название набора

source: update
ru: обновить

source: save
ru: сохранить

source: new word
ru: новое слово

source: enter word
ru: введите слово

source: enter part of speech
ru: введите часть речи

source: enter transcription
ru: введите транскрипцию

source: enter translation
ru: введите перевод

source: add
ru: добавить

source: cancel
ru: отмена

source: reset progress
ru: сброшен прогресс

source: learning
ru: на изучении

# leftLearning
source: in progress
ru: на изучении

source: learnt
ru: изучены

# noWordsYet
source: there are no word sets yet ˙◠˙
ru: пока наборов слов нет ˙◠˙

# wordsAddedToDictionary
source: words are added to the dictionary!
ru: слова добавлены в словарь!

# wordsREmeovedFromDictionary
source: words are removed from the dictionary!
ru: слова удалены из словаря!

source: add to dictionary
ru: добавить в словарь

source: remove from dictionary
ru: удалить из словаря

# noWordYet
source: no words yet ˙◠˙
ru: пока слов нет ˙◠˙

# noSuchWords
source: there are no such words ˙◠˙
ru: таких слов нет ˙◠˙

# addWordsFromDictioanry
source: add words from sets
ru: добавить слова из наборов

source: learn
ru: изучить

source: already know
ru: уже знаю

# changeWord
source: change
ru: изменить

# removeWordFromDict
source: do you want to remove this word from your dictionary?
ru: хотите удалить это слово из своего словаря?

# addWordToDict
source: would you like to add this word to your dictionary?
ru: хотите добавить это слово в свой словарь?

# removeWord
source: remove
ru: удалить

# addWord
source: add
ru: добавить

# removeWordPermanently
source: do you want to remove this word from the dictionary permanently?
ru: хотите удалить это слово из словаря навсегда?

# markAsLearnt
source: mark this word as learnt?
ru: хотите переместить это слово в изученные?

source: yes
ru: да

# markAsNew
source: mark this word as new?
ru: хотите сбросить прогресс этого слова?

# newWords
source: new
ru: новые

# goal
source: goal: {goal} min
ru: цель: {goal} мин

source: change goal
ru: изменить цель

# tenMinutes
source: 10 minutes
ru: 10 минут

# fifteenMinutes
source: 15 minutes
ru: 15 минут

# thirtyMinutes
source: 30 minutes
ru: 30 минут

# addedWords
source: added words: {wordsInDictionary}
ru: в словаре слов: {wordsInDictionary}

# learntWords
source: learnt words: {learntWords}
ru: выучено слов: {learntWords}

# notEnoughWords
source: not enough words for the training ˙◠˙
ru: пока недостаточно слов для тренировки ˙◠˙

source: results
ru: результаты

source: right answers
ru: верные ответы

source: mistakes
ru: ошибки

# checkWord
source: check my answer
ru: проверить

# mistakesCount
source: mistakes: {mistakes}
ru: ошибок: {mistakes}

# correctAnswersCount
source: right answers: {correctAnswersCount}
ru: ответов: {correctAnswersCount}

# endTrainings
source: end training
ru: завершить тренировку

source: i know, won't forget
ru: знаю, не забуду

source: i know, might forget
ru: знаю, могу забыть

source: i don't remember
ru: не помню

source: sent to learning
ru: отправлено на изучение

# onLearning
source: still learning
ru: на повторении

source: sent to learnt
ru: изучено

source: continue training
ru: продолжить тренировку

# timeLeft
source: time left to complete the goal {time} minutes
ru: до выполнения цели осталось {time} минут

source: word-translation
ru: слово-перевод

source: translation-word
ru: перевод-слово

# matchingWords
source: match the words
ru: мэтч

source: word cards
ru: карточки

# dictant
source: dictation
ru: диктант

source: combo
ru: комбо

source: repeat words
ru: повторение

source: my dictionary
ru: мой словарь

# shouldDeleteSet
source: are you sure you want to delete this set of words?
ru: вы уверены, что хотите удалить набор слов?

# shouldExit
source: are you sure you want to leave?
ru: вы уверены, что хотите выйти?

# currentlyLearning
source: currently learning : {setName}
ru: сейчас на изучении : {setName}

# sendSetToTrainings
source: send to training
ru: отправить на изучение

# learntPercentage
source: {learntPercentage} % learned
ru: выучено {learntPercentage} %

# addNotes
source: add notes to translation
ru: добавить примечание к переводу

# noInternetConnection
source: please check internet connection ˙◠˙
ru: пожалуйста, проверьте подключение к интернету ˙◠˙

# translateOnline
source: translate in Yandex
ru: перевести в Yandex

# couldntTranslate
source: sorry, couldn't translate this word ˙◠˙
ru: извините, не получилось перевести ˙◠˙

source: pass
ru: пропуск

# filterButton
source: filter button {filter}
ru: кнопка фильтрации {filter}

source: selected
ru: выбрано

source: not selected
ru: не выбрано

# searchButton
source: search
ru: искать

# clearButton
source: clear
ru: очистить

# progress
source: {learnt} trainings passed
ru: пройдено {learnt} тренировок

# speakButton
source: pronounce
ru: произнести слово

# deleteWordFromDictionaryButton
source: delete this word from the dictionary
ru: удалить слово из словаря

# addWordToDictionaryButton
source: add this word to my dictionary
ru: добавить слово в словарь

# deleteWordFromDBButton
source: delete this word permanently
ru: удалить слово навсегда

# exitButton
source: exit
ru: выйти

# addNotesToTranslation
source: add notes to {translation} translation
ru: добавить примечание к переводу {translation}

source: add another translation
ru: добавить перевод

# removeThisTranslation
source: remove {translation} translation
ru: убрать перевод {translation}

# wordsRemaining
source: {count} words remaining
ru: {count, plural, one {осталось {count} слово} few {осталось {count} слова} many {осталось {count} слов} other {осталось {count} слов}}

source: right answer
ru: правильный ответ

source: wrong answer
ru: неправильный ответ

# wordRightInWTandTWResult
source: {word} no mistake
ru: {word} отвечено правильно

# wordWrongInWTandTWResult
source: {word} mistake
ru: {word} отвечено неправильно

# hintButton
source: hint
ru: подсказка

source: not chosen
ru: не выбрано

source: chosen
ru: выбрано

# chosenRight
source: right choice
ru: выбрано верно

# chosenWrong
source: wrong choice
ru: выбрано неверно

# currentDictantAnswer
source: current answer
ru: текущий ответ

# wordNotEntered
source: empty field
ru: нет ответа

source: goal completed
ru: цель выполнена

source: goal uncompleted
ru: цель не выполнена

# wrongChoiceNAttemptsLeft
source: wrong choice, {count} attempts left
ru: {count, plural, one {выбрано неверно, осталась {count} попытка} few {выбрано неверно, осталось {count} попытки} many {выбрано неверно, осталось {count} попыток} other {выбрано неверно, осталось {count} попыток}}

# wrongAnswerNAttemptsLeft
source: wrong answer, {count} attempts left
ru: {count, plural, one {неправильный ответ, осталась {count} попытка} few {неправильный ответ, осталось {count} попытки} many {неправильный ответ, осталось {count} попыток} other {неправильный ответ, осталось {count} попыток}}

# wordTranslationDesc
source: word-translation: choose the correct translation into Russian
ru: слово-перевод: выберите правильный перевод на русский

# translationWordDesc
source: translation-word: choose the correct translation into English
ru: перевод-слово: выберите правильный перевод на английский

# matchingWordsDesc
source: math the words: pair the word with its translation
ru: мэтч: сопоставьте слово с переводом

# wordCardsDesc
source: word cards: choose the correct translation from two options
ru: карточки: выберите правильный перевод из двух вариантов

# dictantDesc
source: dictation: write down the translation of the word in English
ru: диктант: запишите перевод слова на английский

# comboDesc
source: combo: a combination of word-translation, translation-word, and dictation trainings
ru: комбо: комбинация тренировок слово-перевод, перевод-слово и диктант

# repeatWordsDesc
source: repeat words: track the progress of learned words
ru: повторение: отследите прогресс изученных слов

# turnAutoSpeakOn
source: turn on auto-speak
ru: включить автопроизношение

# turnAutoSpeakOff
source: turn off auto-speak
ru: выключить автопроизношение
